[
  {
  "uid": "TPS0617",
  "updateDate": "2019-06-14T01:00:00.0Z",
  "titleText": "We're a Tobacco Free Generation supporter",
  "mainText": "Turning Point Scotland has become the most recent organisation to sign up to Ash Scotland's Charter for a Tobacco-free Generation. Ash aims to support organisations whose work impacts on children, young people and families to address tobacco issues, and support organisations to take action to reduce the harm caused by tobacco.",
  "redirectionUrl": "https://www.ashscotland.org.uk/charter"
  },
  {
  "uid": "TPS0514",
  "updateDate": "2019-05-14T01:00:00.0Z",
  "titleText": "Mental health week 2019",
  "mainText": "As part of Mental Health Awareness Week, Rosie's Cafe in Aberdeen is holding an exhibition of the artwork that some people we support have created. Pop along and have a look at Rosie's Cafe, 137 Rosemount Place, Aberdeen.",
  "redirectionUrl": "http://www.rosiesenterprises.com/café"
  },
  {
  "uid": "TPS0510",
  "updateDate": "2019-05-10T01:00:00.0Z",
  "titleText": "Learning disability week 2019",
  "mainText": "Scotland's learning disability week is taking place from Monday 13th May and our services are planning various events to mark the occasion. T.P.S. Renfrewshire is planning workshops to help people we support to explore, hands-on, the potential of digital technologies including games consoles, tablets and digital assistants like your Amazon Echo. We'll be posting updates throughout the week on our Twitter and Facebook streams so keep an eye out for these.",
  "redirectionUrl": "http://www.turningpointscotland.com/"
  },
  {
    "uid": "TPS042601",
    "updateDate": "2019-04-26T01:00:00.0Z",
    "titleText": "Happy retirement!",
    "mainText": "We want to wish a very happy retirement to Director of Operations Wendy Spencer. Wendy has devoted 20 years to Turning Point Scotland and the social care sector. On behalf of all staff and people we support, 'Don't be sad it is over, we are all just very grateful it happened.'",
    "redirectionUrl": "http://www.turningpointscotland.com/"
  },
  {
    "uid": "TPS042401",
    "updateDate": "2019-04-24T01:00:00.0Z",
    "titleText": "Ramping up - Housing First Scotland Annual Conference 2019",
    "mainText": "Our very own Patrick McKay will be speaking at the Housing First Annual conference on 22nd May. Held at the Edinburgh International Conference Centre, this 'Ramping Up' event will look at the Housing First approach and what this means for homelessness in Scotland. Patrick will be discussing the seven principles that underpin Housing First and contribute to its success. The session will be a mastercalss for those already delivering Housing First, or those new to it. Join us and a host of other speakers at the Housing First Annual Conference, 2019.",
    "redirectionUrl": "https://www.ghn.org.uk/shien/housing-first/housing-first-2019/"
  },
  {
    "uid": "TPS041701",
    "updateDate": "2019-04-17T01:00:00.0Z",
    "titleText": "Supporting local communities",
    "mainText": "Congratulations to staff and people being supported by our Dumfries and Galloway service for raising money to buy a Dermlite machine for Castle Douglas Health Centre. This machine will allow G.P's to diagnose melanoma and other skin cancers at a surgery appointment. Having this service locally means that people won't have to travel into Dumfries for initial diagnosis, reducing the distance and logistics of travelling.",
    "redirectionUrl": "http://www.turningpointscotland.com/news/dumfries-galloway-service-raise-cash-to-fight-skin-cancer/"
  }
]
